InformationRegisters/ВАТСжурналЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ВАТСжурналЗвонков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СНомера</Name>
					<Comment>Звонящий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаНомер</Name>
					<Comment>Вызываемый</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>callstatus</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>direction</Name>
					<Comment>Вход/исход</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>recordUrl</Name>
					<Comment>Путь к записи звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>state</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>time</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>duration</Name>
					<Comment>Длительность</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>userkey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, связанный со звонком</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачиПользователя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>uuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВАТСжурналЗвонков/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция НайтиЗвонокПоИдентификатору(uuid) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВАТСЗвонкиПоОбъекту.uuid КАК uuid,
		|	ВАТСЗвонкиПоОбъекту.Объект КАК Объект,
		|	ВАТСЗвонкиПоОбъекту.ДатаЗвонка КАК ДатаЗвонка,
		|	ВАТСЗвонкиПоОбъекту.СНомера КАК СНомера,
		|	ВАТСЗвонкиПоОбъекту.callstatus КАК callstatus,
		|	ВАТСЗвонкиПоОбъекту.НаНомер КАК НаНомер,
		|	ВАТСЗвонкиПоОбъекту.Пользователь КАК Пользователь,
		|	ВАТСЗвонкиПоОбъекту.direction КАК direction,
		|	ВАТСЗвонкиПоОбъекту.recordUrl КАК recordUrl,
		|	ВАТСЗвонкиПоОбъекту.state КАК state,
		|	ВАТСЗвонкиПоОбъекту.time КАК time,
		|	ВАТСЗвонкиПоОбъекту.userkey КАК userkey
		|ИЗ
		|	РегистрСведений.ВАТСЗвонкиПоОбъекту КАК ВАТСЗвонкиПоОбъекту
		|ГДЕ
		|	ВАТСЗвонкиПоОбъекту.uuid = &uuid";
	
	Запрос.УстановитьПараметр("uuid", uuid);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
		
	Ответ = Новый Структура;
	Для Каждого Эл Из РезультатЗапроса.Колонки Цикл
		Ответ.Вставить(Эл.Имя);
	КонецЦикла;
		
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Ответ,Выборка);	
	Иначе
		Ответ = Неопределено
	КонецЕсли;	
	Возврат Ответ;
	
КонецФункции

Процедура ЗарегистрироватьИлиОбновитьЗвонок(МенеджерЗаписи,Данные) Экспорт
	
	УстановитьПривилегированныйРежим(Истина); 
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Данные);
	МенеджерЗаписи.СНомера		= Данные.from;
	МенеджерЗаписи.НаНомер		= Данные.to;
	МенеджерЗаписи.Записать();	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


#КонецОбласти
